[
    {
        "_id": "625d7a7e16f6e7f624fed6ab",
        "offer": [
            true,
            {
                "sale": 5,
                "oldPrice": 2500
            }
        ],
        "mainPicture": "https://i5.walmartimages.com/asr/21c7b069-095d-4d69-9804-ead78eb46ec4.70deac3f8ba3db098fbd93cc15473b15.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "picture2": "https://i5.walmartimages.com/asr/21c7b069-095d-4d69-9804-ead78eb46ec4.70deac3f8ba3db098fbd93cc15473b15.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "picture3": "https://i5.walmartimages.com/asr/023541c8-2f8e-463e-a971-c64ae60f8bc3.df4687aa152c01a18c059c3a0376dccf.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "picture4": "https://i5.walmartimages.com/asr/e91e5363-b212-4f04-a0a1-5061e03d28b4.ceaa2c2d23b62bcf46ab048ef5194d69.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "productName": "Hisense XClass TV",
        "brand": "HISENSE",
        "category": "LED TV",
        "subCategory": "4K UHD",
        "id_by_category": "led_tv",
        "id_by_subCategory": "Hisense_led_tv_4k_uhd",
        "rating": 5,
        "price": 295,
        "quantity": 50,
        "description": "The Hisense 50 inch A6GX is the first TV ever to support the new XClass TV platform. XClass TV brings you all the joy of TV and none of the frustration. XClass TV is lightning fast, super simple, and tailored for you - which means less waiting, less searching, and more joy. Get to your favorite shows faster with quick-loading streaming services and an advanced voice remote that allows you to search across apps and services. Our simple and intuitive interface makes finding what you want a breeze and brings all your favorites together. Plus, XClass TV remembers your recently viewed programs and gives you recommendations based on what you like to watch. Hisense’s A6GX series combines the latest smart platform with the picture quality you expect. 4K Ultra HD resolution and Dolby Vision HDR deliver crisp, detailed content, at the same time, keeping up with your all your entertainment needs.",
        "comments": [
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Ayala Tate",
                "comment": "Officia in amet aute pariatur tempor aute in eiusmod consectetur dolor aliquip fugiat officia. Nisi reprehenderit nostrud nostrud laboris reprehenderit nisi ullamco excepteur amet. Qui id eiusmod commodo ut excepteur elit excepteur sunt enim. Enim esse non aliquip consequat velit Lorem commodo cillum. Quis dolor sint qui reprehenderit est sint ex cupidatat sint aliqua minim. Do amet elit non aute non ullamco veniam officia ad tempor anim est Lorem aute. Ipsum nostrud eiusmod ipsum id.\r\n"
            },
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Fleming Bennett",
                "comment": "Mollit consequat elit qui aliqua cupidatat ea cupidatat. Laborum sunt ad ex aliquip voluptate. Labore et ipsum irure deserunt sint. Excepteur occaecat aute commodo non. Tempor deserunt incididunt qui aliqua officia fugiat aliqua veniam occaecat eiusmod in dolor laboris. Duis consectetur exercitation pariatur do officia irure mollit aute consequat adipisicing qui elit fugiat.\r\n"
            }
        ]
    },
    {
        "_id": "625d7a7e084885a6a25f97c0",
        "offer": [
            true,
            {
                "sale": 5,
                "oldPrice": 2500
            }
        ],
        "mainPicture": "https://i5.walmartimages.com/asr/c04f4421-08a3-4d99-8cd3-7f51da6c802f.59a47c542389eb7ed4daba316cf88d49.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "picture2": "https://i5.walmartimages.com/asr/f27bff64-a527-4ae6-b1e6-8b5253efe718.2ecd1b9d98d5327d58cc7641e3c5d37e.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "picture3": "https://i5.walmartimages.com/asr/e1970200-7e29-4a77-adb8-73d35d94365c.f0b95bf3157073ffe321211b23ef1ade.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "picture4": "https://i5.walmartimages.com/asr/02ac8e85-17f2-4dde-b9e6-7424476b44f5.793ba4c4a4ba261ca10402fd3839ea86.png?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "productName": "VIZIO 55",
        "brand": "VIZIO",
        "category": "LED TV",
        "subCategory": "4K(2160P)",
        "id_by_category": "led_tv",
        "id_by_subCategory": "vinjio_led_tv_4k",
        "rating": 5,
        "price": 398,
        "quantity": 60,
        "description": "Step up to the infinite possibilities of streaming 4K in award winning Quantum Color with the VIZIO M-Series® 55 inch 4K HDR Smart TV that offers over a billion colors for a more nuanced, more immersive range of colors that brings everything you watch to life. UltraBright™ 400 and Dolby Vision high dynamic range bring the image to thrilling new life, combined with the Active Full Array® backlight to enhance contrast and deepen black levels. The lightning-fast IQ Active™ processor boosts overall performance while the V-Gaming Engine™ with Auto Game Mode and ultra low input lag elevates console gaming*. And VIZIO SmartCast™ is now smarter than ever, letting you stream, control and share like never before, with Apple AirPlay 2 and Chromecast built-in in Dolby Vision and HDR10+ for a best in class 4K streaming experience. *Auto low latency mode only compatible with Xbox One X",
        "comments": [
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Nita Ochoa",
                "comment": "Irure veniam elit exercitation ullamco aliqua officia ullamco laboris excepteur incididunt ipsum deserunt reprehenderit. Magna officia laboris excepteur nisi. Ex commodo fugiat consectetur laborum commodo officia velit nostrud et.\r\n"
            },
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Joan Washington",
                "comment": "Laborum minim reprehenderit in labore irure ut Lorem culpa irure sunt ex. Incididunt ea duis consequat irure irure sit esse ad consequat id. Mollit in esse excepteur excepteur minim reprehenderit in. Irure ullamco id ipsum ex voluptate reprehenderit aute magna fugiat est laboris sint duis adipisicing. Non id ut est minim.\r\n"
            }
        ]
    },
    {
        "_id": "625d7a7ecdee9817d7312e25",
        "offer": [
            true,
            {
                "sale": 5,
                "oldPrice": 2500
            }
        ],
        "mainPicture": "https://i5.walmartimages.com/asr/12012d76-2253-4117-9c52-2a9d6604d0ed.34de4eaa4fe94225530ff3bfb91670c1.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "picture2": "https://i5.walmartimages.com/asr/6d90c963-43b2-4f4a-9432-4d60e16e9c3a.6435ab8962012a226d61b8bf752f77f2.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "picture3": "https://i5.walmartimages.com/asr/22c49861-9db6-43d1-a5a1-bd6b2860a3f0.08fed054fed9638cfc8921f2787ac424.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "picture4": "https://i5.walmartimages.com/asr/c2e040d5-641d-4ce0-857a-95daa83ff903.e35124293f8682a899a697479a184d5c.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
        "productName": "Kidkraft Skyway",
        "brand": "Wooden ",
        "category": "Outdoor Toy",
        "subCategory": "Wooden Swing Set",
        "id_by_category": "outdoor_toy",
        "id_by_subCategory": "outdoor_toy_wooden_sweing_set",
        "rating": 5,
        "price": 1900,
        "quantity": 59,
        "description": "Give kids a place to reach new heights with the thrilling KidKraft Skyway Resort Swing Set. From the thrilling extra-tall ladder to the quaint playhouse, it offers a bit of adventure for all ages and stages of children. Kids will love scampering through the tunnel to the crow's nest to scout out the landscape with the attached telescope. Two swings and two slides provide plenty of energetic play options for multiple children. The area underneath the playhouse can even be used as a sandbox. From obstacle course to role play mode, the Skyway Resort is a blend of active and imaginative play in the backyard for all.",
        "comments": [
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Stone Bauer",
                "comment": "Velit veniam cupidatat quis ipsum fugiat occaecat. Minim proident et eu nostrud eiusmod do consectetur nulla in. Duis excepteur nisi eiusmod duis excepteur sit. Aliqua Lorem non nisi ipsum qui Lorem pariatur aliqua irure. Occaecat pariatur ex voluptate aliquip reprehenderit do veniam occaecat nostrud commodo exercitation et.\r\n"
            },
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Hamilton Mccray",
                "comment": "Irure et est ex consequat. Exercitation cupidatat amet in non pariatur anim cillum adipisicing ad tempor. Exercitation incididunt labore fugiat sint veniam fugiat quis ad cupidatat eu. Consectetur occaecat fugiat non commodo exercitation ullamco voluptate fugiat labore consectetur enim. Velit do eiusmod mollit non incididunt cupidatat consectetur adipisicing aute magna laborum pariatur consequat ullamco. Minim sit commodo et proident irure eiusmod sit anim proident commodo nisi officia. Eiusmod deserunt et mollit ex sunt cupidatat.\r\n"
            }
        ]
    },
    {
        "_id": "625d7a7e1b2ca268afd02fba",
        "offer": [
            true,
            {
                "sale": 5,
                "oldPrice": 2500
            }
        ],
        "mainPicture": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-18_9e4c4ebe-17c9-4f56-94f4-5ab9c6321748_2000x.jpg?v=1485259258",
        "picture2": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-18_9e4c4ebe-17c9-4f56-94f4-5ab9c6321748_2000x.jpg?v=1485259258",
        "picture3": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-18_9e4c4ebe-17c9-4f56-94f4-5ab9c6321748_2000x.jpg?v=1485259258",
        "picture4": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-1_2000x.jpg?v=1484829383",
        "productName": "Jarvis Love",
        "brand": "Enid Hunter",
        "category": "electronic",
        "subCategory": "fan",
        "id_by_category": "e_fan",
        "id_by_subCategory": "e_fan_4",
        "rating": 5,
        "price": 5000,
        "quantity": 50,
        "description": "Ut enim deserunt Lorem voluptate sint anim aliqua elit excepteur. Deserunt anim laboris nisi ad pariatur laborum occaecat labore labore veniam. Excepteur veniam amet commodo sint velit. Nulla aliqua amet nisi pariatur ea adipisicing reprehenderit laboris. Enim est cupidatat consectetur laborum laboris. Id laborum culpa Lorem culpa eu veniam pariatur.\r\n",
        "comments": [
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Cohen Duffy",
                "comment": "Sit aliquip laboris cupidatat ipsum elit nostrud Lorem in ad irure anim nostrud qui laboris. Quis est exercitation non minim ut laborum et proident dolore nisi consectetur esse dolore. Magna irure et quis tempor sunt dolore sint. Voluptate cillum consequat elit qui deserunt duis consequat sit duis. Voluptate anim proident eu irure ea magna velit irure qui minim aute.\r\n"
            },
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Lara Livingston",
                "comment": "Sit est amet qui non. In in do quis ut. Eu ullamco laboris reprehenderit reprehenderit reprehenderit enim excepteur. Minim ut aliquip nisi nisi amet ea. Ad officia enim non id aute cupidatat ipsum eu consequat aliquip eiusmod elit excepteur ex.\r\n"
            }
        ]
    },
    {
        "_id": "625d7a7e17a49358c07be728",
        "offer": [
            true,
            {
                "sale": 5,
                "oldPrice": 2500
            }
        ],
        "mainPicture": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-18_9e4c4ebe-17c9-4f56-94f4-5ab9c6321748_2000x.jpg?v=1485259258",
        "picture2": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-18_9e4c4ebe-17c9-4f56-94f4-5ab9c6321748_2000x.jpg?v=1485259258",
        "picture3": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-18_9e4c4ebe-17c9-4f56-94f4-5ab9c6321748_2000x.jpg?v=1485259258",
        "picture4": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-1_2000x.jpg?v=1484829383",
        "productName": "Jarvis Love",
        "brand": "Enid Hunter",
        "category": "electronic",
        "subCategory": "fan",
        "id_by_category": "e_fan",
        "id_by_subCategory": "e_fan_5",
        "rating": 5,
        "price": 5000,
        "quantity": 50,
        "description": "Culpa voluptate ipsum exercitation reprehenderit ipsum commodo non culpa. Cillum sit pariatur aute ipsum dolor ad duis laboris quis magna. Anim incididunt cupidatat id dolore proident mollit. Esse veniam consectetur adipisicing pariatur consequat velit adipisicing aliquip enim nisi. Voluptate quis enim consectetur quis reprehenderit enim ad laboris fugiat do. Reprehenderit duis magna ullamco ad cillum esse pariatur nulla tempor ex deserunt velit.\r\n",
        "comments": [
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Arline Torres",
                "comment": "Anim aliquip sint occaecat eu nostrud minim qui nulla sit ullamco. Qui minim occaecat tempor sit aliquip anim. Reprehenderit adipisicing cupidatat incididunt esse magna sunt velit commodo. Exercitation ad eu labore incididunt eu incididunt nisi occaecat. Irure ex magna adipisicing occaecat voluptate magna voluptate mollit. Quis voluptate veniam veniam ipsum enim mollit. Nisi cillum nulla occaecat elit tempor do amet non aute cupidatat do adipisicing veniam.\r\n"
            },
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Valenzuela Harper",
                "comment": "Officia incididunt consequat sit Lorem velit incididunt laboris do labore irure quis. Nostrud laboris eiusmod et consequat adipisicing esse duis adipisicing ut. Proident labore laboris mollit non reprehenderit mollit Lorem. Ut anim incididunt culpa mollit sint. Ea ullamco eu nisi tempor. Enim do mollit quis sit proident incididunt aliquip deserunt ad Lorem dolore culpa minim laborum.\r\n"
            }
        ]
    },
    {
        "_id": "625d7a7eb6f834cf16e04056",
        "offer": [
            true,
            {
                "sale": 5,
                "oldPrice": 2500
            }
        ],
        "mainPicture": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-18_9e4c4ebe-17c9-4f56-94f4-5ab9c6321748_2000x.jpg?v=1485259258",
        "picture2": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-18_9e4c4ebe-17c9-4f56-94f4-5ab9c6321748_2000x.jpg?v=1485259258",
        "picture3": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-1_2000x.jpg?v=1484829383",
        "picture4": "https://cdn.shopify.com/s/files/1/1692/8885/products/product-18_9e4c4ebe-17c9-4f56-94f4-5ab9c6321748_2000x.jpg?v=1485259258",
        "productName": "Jarvis Love",
        "brand": "Enid Hunter",
        "category": "electronic",
        "subCategory": "fan",
        "id_by_category": "e_fan",
        "id_by_subCategory": "e_fan_6",
        "rating": 5,
        "price": 5000,
        "quantity": 50,
        "description": "Officia deserunt amet reprehenderit laboris enim consequat incididunt sint non. Exercitation sit et Lorem dolore deserunt sit aliquip sunt. Consectetur dolor deserunt duis consectetur. Cupidatat exercitation tempor consequat officia enim aute laborum sit irure. Duis dolor adipisicing ex quis nulla qui duis ullamco sint aliquip. Quis aliqua nostrud et sit anim voluptate consectetur laborum ullamco aliqua ullamco cupidatat. In veniam amet nulla tempor voluptate.\r\n",
        "comments": [
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Pittman Stout",
                "comment": "Lorem officia culpa esse duis et ut non esse fugiat veniam officia. Aliquip qui do commodo id voluptate culpa cillum. Magna sint ea cillum tempor labore eiusmod sint.\r\n"
            },
            {
                "displayPicture": "http://placehold.it/32x32",
                "name": "Shepherd Reed",
                "comment": "Duis et nulla sit ullamco nulla exercitation ad aliqua non culpa sit. Irure aute eu sit voluptate commodo eu veniam reprehenderit dolore dolore nostrud eu voluptate. Et elit amet commodo mollit fugiat elit ut do anim nostrud do laborum veniam veniam.\r\n"
            }
        ]
    }
]